{"format": "graph-model", "generatedBy": "2.18.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"keras_tensor_39": {"name": "keras_tensor_39:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "100"}, {"size": "100"}, {"size": "3"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "65"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_2_1/conv2d_8_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/conv2d_8_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/batch_normalization_8_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/batch_normalization_8_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/conv2d_9_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "8"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/conv2d_9_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/batch_normalization_9_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/batch_normalization_9_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/conv2d_10_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/conv2d_10_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/batch_normalization_10_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/batch_normalization_10_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/conv2d_11_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/conv2d_11_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/batch_normalization_11_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/batch_normalization_11_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/flatten_2_1/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/dense_4_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1600"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/dense_4_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/dense_5_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "65"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/dense_5_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "65"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "keras_tensor_39", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "100"}, {"size": "100"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/conv2d_8_1/Relu", "op": "_FusedConv2D", "input": ["keras_tensor_39", "StatefulPartitionedCall/sequential_2_1/conv2d_8_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_2_1/conv2d_8_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_2_1/batch_normalization_8_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_2_1/conv2d_8_1/Relu", "StatefulPartitionedCall/sequential_2_1/batch_normalization_8_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/batch_normalization_8_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_2_1/batch_normalization_8_1/batchnorm/mul_1", "StatefulPartitionedCall/sequential_2_1/batch_normalization_8_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/max_pooling2d_8_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_2_1/batch_normalization_8_1/batchnorm/add_1"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_2_1/conv2d_9_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_2_1/max_pooling2d_8_1/MaxPool2d", "StatefulPartitionedCall/sequential_2_1/conv2d_9_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_2_1/conv2d_9_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_2_1/batch_normalization_9_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_2_1/conv2d_9_1/Relu", "StatefulPartitionedCall/sequential_2_1/batch_normalization_9_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/batch_normalization_9_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_2_1/batch_normalization_9_1/batchnorm/mul_1", "StatefulPartitionedCall/sequential_2_1/batch_normalization_9_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/max_pooling2d_9_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_2_1/batch_normalization_9_1/batchnorm/add_1"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_2_1/conv2d_10_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_2_1/max_pooling2d_9_1/MaxPool2d", "StatefulPartitionedCall/sequential_2_1/conv2d_10_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_2_1/conv2d_10_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_2_1/batch_normalization_10_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_2_1/conv2d_10_1/Relu", "StatefulPartitionedCall/sequential_2_1/batch_normalization_10_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/batch_normalization_10_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_2_1/batch_normalization_10_1/batchnorm/mul_1", "StatefulPartitionedCall/sequential_2_1/batch_normalization_10_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/max_pooling2d_10_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_2_1/batch_normalization_10_1/batchnorm/add_1"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_2_1/conv2d_11_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_2_1/max_pooling2d_10_1/MaxPool2d", "StatefulPartitionedCall/sequential_2_1/conv2d_11_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_2_1/conv2d_11_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_2_1/batch_normalization_11_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_2_1/conv2d_11_1/Relu", "StatefulPartitionedCall/sequential_2_1/batch_normalization_11_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/batch_normalization_11_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_2_1/batch_normalization_11_1/batchnorm/mul_1", "StatefulPartitionedCall/sequential_2_1/batch_normalization_11_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/max_pooling2d_11_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_2_1/batch_normalization_11_1/batchnorm/add_1"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_2_1/flatten_2_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_2_1/max_pooling2d_11_1/MaxPool2d", "StatefulPartitionedCall/sequential_2_1/flatten_2_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/dense_4_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_2_1/flatten_2_1/Reshape", "StatefulPartitionedCall/sequential_2_1/dense_4_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_2_1/dense_4_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/dense_5_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_2_1/dense_4_1/Relu", "StatefulPartitionedCall/sequential_2_1/dense_5_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_2_1/dense_5_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/dense_5_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_2_1/dense_5_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_2_1/dense_5_1/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1994}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_2_1/conv2d_8_1/convolution/ReadVariableOp", "shape": [3, 3, 3, 8], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2_1/conv2d_8_1/Squeeze", "shape": [8], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2_1/batch_normalization_8_1/batchnorm/mul", "shape": [8], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2_1/batch_normalization_8_1/batchnorm/sub", "shape": [8], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2_1/conv2d_9_1/convolution/ReadVariableOp", "shape": [3, 3, 8, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2_1/conv2d_9_1/Squeeze", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2_1/batch_normalization_9_1/batchnorm/mul", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2_1/batch_normalization_9_1/batchnorm/sub", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2_1/conv2d_10_1/convolution/ReadVariableOp", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2_1/conv2d_10_1/Squeeze", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2_1/batch_normalization_10_1/batchnorm/mul", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2_1/batch_normalization_10_1/batchnorm/sub", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2_1/conv2d_11_1/convolution/ReadVariableOp", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2_1/conv2d_11_1/Squeeze", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2_1/batch_normalization_11_1/batchnorm/mul", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2_1/batch_normalization_11_1/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2_1/flatten_2_1/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2_1/dense_4_1/Cast/ReadVariableOp", "shape": [1600, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2_1/dense_4_1/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2_1/dense_5_1/Cast/ReadVariableOp", "shape": [64, 65], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2_1/dense_5_1/BiasAdd/ReadVariableOp", "shape": [65], "dtype": "float32"}]}]}